marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey-touchdesigner.cpp
// TouchDesigner specific code.
// How to use it:
// 1. Rename the existing main-m5stack-grey.cpp file to main-m5stack-grey-original.cpp and rename this file to "main-m5stack-grey.cpp"
// 2. TouchDesigner connects over serial and the buttons are emulated by sending a character to the device: 'A' = Button A, 'B' = Button B, 'C' = Button C
// 3. You'll need to have the devices paired first with Bluetooth (as entry of the pincode can't be done over serial in this code)
// Good luck!

// TouchDesigner instructions:
// Send a string through serial with a terminator value of "\n"
// E.g. to send "B" on serial1 the command is: op('serial1').send("B", terminator="\n")
// E.g. op('serial1').send("(ISO:2000)", terminator="\n")
// Commands must start with a "(", have a ":" to separate the command and the value, and to end with a ")"
// Commands are not case-sensitive (e.g. "ISO" will work and "iSo" will also work)
// 
// Examples:
// 
// (ISO:1600)
// (ISO:999)
// (CODEC:BRAW)
//
// Available commands are:
// 
// BUTTON:A   // same as pressing the A button on the M5Stack
// BUTTON:B
// BUTTON:C
// RECORD:START
// RECORD:STOP
// ISO:100 up to ISO:25600
// SHUTTERANGLE:1 up to SHUTTERANGLE:360
// SHUTTERSPEED:24 up to SHUTTERSPEED:2000
// WHITEBALANCE:2500 up to WHITEBALANCE:10000
// TINT:-50 up to TINT:50
// BRAWQ:0    // Q0
// BRAWQ:3    // Q3
// BRAWQ:5    // Q5
// BRAWQ:8    // Q8
// BRAWB:3    // 3:1
// BRAWB:5    // 5:1
// BRAWB:8    // 8:1
// BRAWB:12   // 12:1
//
// Want to create your own commands and actions - see the function "RunTouchDesignerCommand" in this file


#define USING_TFT_ESPI 0        // Not using the TFT_eSPI graphics library <-- must include this in every main file, 0 = not using, 1 = using
#define USING_M5GFX 0           // Using the M5GFX library with touch screen
#define USING_M5_BUTTONS 1   // Using the M5GFX library with the 3 buttons (buttons A, B, C)

#define OUTPUT_CAMERA_SETTINGS 1  // 1 = Outputs camera settings through serial (so other applications can read them)

#include <ESP32-Chimera-Core.h>

#define tft M5.Lcd
static LGFX_Sprite *sprite;

#include <Arduino.h>
#include <string.h>

#include "Arduino_DebugUtils.h" // Debugging to Serial - https://github.com/arduino-libraries/Arduino_DebugUtils

// Main BMD Libraries
#include "Camera/ConstantsTypes.h"
#include "Camera/PacketWriter.h"
#include "CCU/CCUUtility.h"
#include "CCU/CCUPacketTypes.h"
#include "CCU/CCUValidationFunctions.h"
#include "Camera/BMDCameraConnection.h"
#include "Camera/BMDCamera.h"
#include "BMDControlSystem.h"

// Include the watchdog library so we can stop it timing out while pass key entry.
#include "esp_task_wdt.h"

// TouchDesigner
std::string tdCommand = "";
bool tdCommandComplete = false;
int tdMaxLength = 50; // Accept up to 50 characters, including '(', ':', and ')'

// Lato font from Google Fonts
// Agency FB font is free for commercial use, copied from Windows fonts
// Rather than using font sizes, we use specific fonts for each size as it renders better on screen
#include "Fonts/Lato_Regular12pt7b.h" // Slightly larger version
#include "Fonts/Lato_Regular11pt7b.h" // Standard font
#include "Fonts/Lato_Regular6pt7b.h" // Small version for camera address
#include "Fonts/Lato_Regular5pt7b.h" // Smallest version
#include "Fonts/AgencyFB_Regular7pt7b.h" // Agency FB for tiny text
#include "Fonts/AgencyFB_Bold9pt7b.h" // Agency FB small for above buttons
#include "Fonts/AgencyFB_Regular9pt7b.h" // Agency FB small-medium for above buttons

// Screen width and height
#define IWIDTH 320
#define IHEIGHT 240

// Sprite width and height (limited by the lack of PSRAM on this device, Set to 8bpp, instead of 16bpp)
// We'll draw the side bar, the button labels, and the recording rectangle separately to the sprite
// Note: If you try to use a sprite that takes too much memory it may not show at all or Bluetooth will not connect properly
#define IWIDTH_SPRITE 320 // 300
#define IHEIGHT_SPRITE 240 // 208
#define BPP_SPRITE 8

// Sprites for Images
// Not using sprites, writing directly to M5.Display (aka "window")
// This causes flashing on the display, so we need to address this
/*
LGFX_Sprite spriteMPCSplash;
LGFX_Sprite spriteBluetooth;
LGFX_Sprite spritePocket4k;
LGFX_Sprite spriteWBBright;
LGFX_Sprite spriteWBCloud;
LGFX_Sprite spriteWBFlourescent;
LGFX_Sprite spriteWBIncandescent;
LGFX_Sprite spriteWBMixedLight;
LGFX_Sprite spriteWBBrightBG;
LGFX_Sprite spriteWBCloudBG;
LGFX_Sprite spriteWBFlourescentBG;
LGFX_Sprite spriteWBIncandescentBG;
LGFX_Sprite spriteWBMixedLightBG;
*/

// Images
#include "Images/MPCSplash-M5Stack-CoreS3.h"
#include "Images/ImageBluetooth.h"
#include "Images/ImagePocket4k.h"
#include "Images/WBBright.h"
#include "Images/WBCloud.h"
#include "Images/WBFlourescent.h"
#include "Images/WBIncandescent.h"
#include "Images/WBMixedLight.h"
#include "Images/WBBrightBG.h"
#include "Images/WBCloudBG.h"
#include "Images/WBFlourescentBG.h"
#include "Images/WBIncandescentBG.h"
#include "Images/WBMixedLightBG.h"

BMDCameraConnection cameraConnection;
std::shared_ptr<BMDControlSystem> BMDControlSystem::instance = nullptr; // Required for Singleton pattern and the constructor for BMDControlSystem
BMDCameraConnection* BMDCameraConnection::instancePtr = &cameraConnection; // Required for the scan function to run non-blocking and call the object back with the result

enum class Screens : byte
{
  PassKey = 9,
  NoConnection = 10,
  Dashboard = 100,
  Recording = 101,
  ISO = 102,
  ShutterAngleSpeed = 103,
  WhiteBalanceTintWB = 104, // Editing White Balance
  WhiteBalanceTintT = 124, // Editing Tint
  Codec = 105,
  Framerate = 106,
  Resolution = 107,
  Media = 108,
  Lens = 109,
  Slate = 110,
  Project = 111
};

Screens connectedScreenIndex = Screens::NoConnection; // The index of the screen we're on:
// 9 is Pass Key
// 10 is No Connection
// 100 is Dashboard
// 101 is Recording
// 102 is ISO
// 103 is Shutter Angle & Shutter Speed
// 104 is WB / Tint - Edit WB
// 105 is Codec
// 106 is Framerate
// 107 is Resolution (one for each camera group, 4K, 6K/G2/Pro, Mini Pro G2, Mini Pro 12K)
// 108 is Media
// 109 is Lens
// 124 is WB / Tint - Edit Tint

// Keep track of the last camera modified time that we refreshed a screen so we don't keep refreshing a screen when the camera object remains unchanged.
static unsigned long lastRefreshedScreen = 0;

// Button pressed indications for use in each individual page
bool btnAPressed = false;
bool btnBPressed = false;

