marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey-touchdesigner.cpp
// Display elements on the screen common to all pages
void Screen_Common(int sideBarColour)
{
    // DEBUG_DEBUG("Screen_Common");

    // Sidebar colour
    sprite->fillRect(0, 0, 13, IHEIGHT, sideBarColour);
    sprite->fillRect(13, 0, 2, IHEIGHT, TFT_DARKGREY);

    if(BMDControlSystem::getInstance()->hasCamera())
    {
      auto camera = BMDControlSystem::getInstance()->getCamera();

      sprite->setTextColor(TFT_WHITE);

      if(connectedScreenIndex == Screens::Dashboard)
      {
        // Dashboard Bottom Buttons
        sprite->fillSmoothRoundRect(30, 210, 80, 40, 3, TFT_DARKCYAN);
        sprite->drawCenterString("TBD", 70, 217, &AgencyFB_Bold9pt7b);

        if(camera->isRecording)
          sprite->fillSmoothCircle(IWIDTH / 2, 240, 30, TFT_RED);
        else
        {
          // Two outlines to make it a bit thicker
          sprite->drawCircle(IWIDTH / 2, 240, 30, TFT_RED);
          sprite->drawCircle(IWIDTH / 2, 240, 29, TFT_RED);
        }
      }
      else if(connectedScreenIndex == Screens::Recording)
      {
        // Recording Screen Bottom Buttons
        sprite->fillSmoothRoundRect(30, 210, 80, 40, 3, TFT_DARKCYAN);
        sprite->drawCenterString("TBD", 70, 217, &AgencyFB_Bold9pt7b);

        if(camera->isRecording)
          sprite->fillSmoothCircle(IWIDTH / 2, 240, 30, TFT_RED);
        else
        {
          // Two outlines to make it a bit thicker
          sprite->drawCircle(IWIDTH / 2, 240, 30, TFT_RED);
          sprite->drawCircle(IWIDTH / 2, 240, 29, TFT_RED);
        }
      }
      else
      {
        // Other Screens Bottom Buttons

        switch(connectedScreenIndex)
        {
          case Screens::ISO:
          case Screens::ShutterAngleSpeed:
          case Screens::WhiteBalanceTintT:
          case Screens::Codec:
          case Screens::Resolution:
          case Screens::Media:
          case Screens::Lens:
            sprite->fillSmoothRoundRect(30, 210, 170, 40, 3, TFT_DARKCYAN);
            sprite->fillTriangle(60, 235, 70, 215, 50, 215, TFT_WHITE); // Up Arrow
            sprite->fillTriangle(150, 235, 170, 235, 160, 215, TFT_WHITE); // Down Arrow
            break;
          case Screens::WhiteBalanceTintWB:
            // White Balance shows Presets or increment
            sprite->fillSmoothRoundRect(30, 210, 80, 40, 3, TFT_DARKCYAN);
            sprite->drawCenterString("PRESET", 70, 217, &AgencyFB_Bold9pt7b);

            sprite->fillSmoothRoundRect(120, 210, 80, 40, 3, TFT_DARKCYAN);
            sprite->drawCenterString("+100", 160, 217, &AgencyFB_Bold9pt7b);
            break;
        }
      }

      // Common Next Button
      sprite->fillSmoothRoundRect(215, 210, 80, 40, 3, TFT_DARKCYAN);
      sprite->drawCenterString("NEXT", 255, 217, &AgencyFB_Bold9pt7b);
    }
}

void Screen_Common_Connected()
{
  if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::Connected && BMDControlSystem::getInstance()->hasCamera())
  {
    Screen_Common(cameraConnection.getInitialPayloadTime() < millis() ? TFT_GREEN : TFT_DARKGREY);

    // Show the recording outline
    if(BMDControlSystem::getInstance()->getCamera()->isRecording)
    {
      // Turn on recording box
      sprite->drawRect(15, 0, IWIDTH - 15, IHEIGHT, TFT_RED);
      sprite->drawRect(16, 1, IWIDTH - 13, IHEIGHT - 2, TFT_RED);
    }
  }
}

// Screen for when there's no connection, it's scanning, and it's trying to connect.
void Screen_NoConnection()
{
  DEBUG_DEBUG("Screen_NoConnection");

  if(!sprite->createSprite(IWIDTH_SPRITE, IHEIGHT_SPRITE)) return;

  // The camera to connect to.
  int connectToCameraIndex = -1;

  connectedScreenIndex = Screens::NoConnection;

  // Background on the sprite (overlay the part of the background that covers the sprite)
  sprite->pushImage(0, 0, IWIDTH, IHEIGHT, MPCSplash_M5Stack_CoreS3);

  // Black background for text and Bluetooth Logo
  sprite->fillRect(0, 3, IWIDTH, 51, TFT_BLACK);

  // Bluetooth Image
  sprite->pushImage(26, 6, 30, 46, Wikipedia_Bluetooth_30x46);

  switch(cameraConnection.status)
  {
    case BMDCameraConnection::Scanning:
      Screen_Common(TFT_BLUE); // Common elements
      sprite->drawString("Scanning...", 70, 20);
      break;
    case BMDCameraConnection::ScanningFound:
      Screen_Common(TFT_BLUE); // Common elements
      if(cameraConnection.cameraAddresses.size() == 1)
      {
        sprite->drawString("Found, connecting...", 70, 20);
        connectToCameraIndex = 0;
      }
      else
        sprite->drawString("Found cameras", 70, 20); // Multiple camera selection is below
      break;
    case BMDCameraConnection::ScanningNoneFound:
      Screen_Common(TFT_RED); // Common elements
      sprite->drawString("No camera found", 70, 20);
      break;
    case BMDCameraConnection::Connecting:
      Screen_Common(TFT_YELLOW); // Common elements
      sprite->drawString("Connecting...", 70, 20);
      break;
    case BMDCameraConnection::NeedPassKey:
      Screen_Common(TFT_PURPLE); // Common elements
      sprite->drawString("Need Pass Key", 70, 20);
      break;
    case BMDCameraConnection::FailedPassKey:
      Screen_Common(TFT_ORANGE); // Common elements
      sprite->drawString("Wrong Pass Key", 70, 20);
      break;
    case BMDCameraConnection::Disconnected:
      DEBUG_DEBUG("NoConnection - Disconnected");
      Screen_Common(TFT_RED); // Common elements
      sprite->drawString("Disconnected (wait)", 70, 20);
      break;
    case BMDCameraConnection::IncompatibleProtocol:
      // Note: This needs to be worked on as there's no incompatible protocol connections yet.
      Screen_Common(TFT_RED); // Common elements
      sprite->drawString("Incompatible Protocol", 70, 20);
      break;
    default:
      break;
  }

  // Show up to two cameras
  int cameras = cameraConnection.cameraAddresses.size();
  for(int count = 0; count < cameras && count < 2; count++)
  {
    // Cameras
    sprite->fillRoundRect(25 + (count * 125) + (count * 10), 60, 125, 100, 5, TFT_DARKGREY);

    // Highlight the camera to connect to
    if(connectToCameraIndex != -1 && connectToCameraIndex == count)
    {
      sprite->drawRoundRect(25 + (count * 125) + (count * 10), 60, 5, 2, TFT_GREEN);
    }

    sprite->pushImage(33 + (count * 125) + (count * 10), 69, 110, 61, blackmagic_pocket_4k_110x61);

    sprite->drawString(cameraConnection.cameraAddresses[count].toString().c_str(), 33 + (count * 125) + (count * 10), 144, &Lato_Regular6pt7b);
  }

  // If there's more than one camera, check for a tap to see if they have nominated one to connect to
  /*
  if(cameras > 1 && tapped_x != -1)
  {
      if(tapped_x >= 25 && tapped_y >= 60 && tapped_x <= 150 && tapped_y <= 160)
      {
        // First camera tapped
        connectToCameraIndex = 0;
      }
      else if(tapped_x >= 160 && tapped_y >= 60 && tapped_x <= 285 && tapped_y <= 160)
      {
        // Second camera tapped
        connectToCameraIndex = 1;
      }
  }
  */

  if(connectToCameraIndex != -1)
  {
    cameraConnection.connect(cameraConnection.cameraAddresses[connectToCameraIndex]);
    connectToCameraIndex = -1;

    if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::FailedPassKey)
    {
      DEBUG_DEBUG("NoConnection - Failed Pass Key");
    }
  }

  sprite->pushSprite(0, 0);
}

