marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey-touchdesigner.cpp
// Default screen for connected state
void Screen_Dashboard(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Dashboard;

  auto camera = BMDControlSystem::getInstance()->getCamera();
  int xshift = 0;

  bool tappedAction = false;

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh)
  // if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  // DEBUG_DEBUG("Screen Dashboard Refreshing.");

  if(!sprite->createSprite(IWIDTH_SPRITE, IHEIGHT_SPRITE)) return;

  if(cameraConnection.getInitialPayloadTime() != ULONG_MAX)
    sprite->fillSprite(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // Set font here rather than on each drawString line
  sprite->setFont(&Lato_Regular11pt7b);

  // ISO
  if(camera->hasSensorGainISOValue())
  {
    sprite->fillSmoothRoundRect(20, 5, 75, 65, 3, TFT_DARKGREY);
    sprite->setTextColor(TFT_WHITE);

    sprite->drawCentreString(String(camera->getSensorGainISOValue()), 58, 23);

    sprite->drawCentreString("ISO", 58, 50, &AgencyFB_Regular7pt7b);
  }

  // Shutter
  xshift = 80;
  if(camera->hasShutterAngle() || camera->hasShutterSpeed())
  {
    sprite->fillSmoothRoundRect(20 + xshift, 5, 75, 65, 3, TFT_DARKGREY);
    sprite->setTextColor(TFT_WHITE);

    if(camera->shutterValueIsAngle && camera->hasShutterAngle())
    {
      // Shutter Angle
      int currentShutterAngle = camera->getShutterAngle();
      float ShutterAngleFloat = currentShutterAngle / 100.0;

      sprite->drawCentreString(String(ShutterAngleFloat, (currentShutterAngle % 100 == 0 ? 0 : 1)), 58 + xshift, 23);
    }
    else if(camera->hasShutterSpeed())
    {
      // Shutter Speed
      int currentShutterSpeed = camera->getShutterSpeed();

      sprite->drawCentreString("1/" + String(currentShutterSpeed), 58 + xshift, 23);
    }

    sprite->drawCentreString(camera->shutterValueIsAngle ? "DEGREES" : "SPEED", 58 + xshift, 50, &AgencyFB_Regular7pt7b); //  "SHUTTER"
  }

  // WhiteBalance and Tint
  xshift += 80;
  if(camera->hasWhiteBalance() || camera->hasTint())
  {
    sprite->fillSmoothRoundRect(20 + xshift, 5, 135, 65, 3, TFT_DARKGREY);
    sprite->setTextColor(TFT_WHITE);

    if(camera->hasWhiteBalance())
      sprite->drawCentreString(String(camera->getWhiteBalance()), 58 + xshift, 23);

    sprite->drawCentreString("WB", 58 + xshift, 50, &AgencyFB_Regular7pt7b);

    xshift += 66;

    if(camera->hasTint())
      sprite->drawCentreString(String(camera->getTint()), 58 + xshift, 23);

    sprite->drawCentreString("TINT", 58 + xshift, 50, &AgencyFB_Regular7pt7b);
  }

  // Codec
  if(camera->hasCodec())
  {
    sprite->fillSmoothRoundRect(20, 75, 155, 40, 3, TFT_DARKGREY);

    sprite->drawCentreString(camera->getCodec().to_string().c_str(), 97, 84);
  }

  // Media
  if(camera->getMediaSlots().size() != 0)
  {
    std::string slotString;

    for(int i = 0; i < camera->getMediaSlots().size(); i++)
    {
      if(camera->getMediaSlots()[i].active)
      {
        switch(camera->getMediaSlots()[i].medium)
        {
          case CCUPacketTypes::ActiveStorageMedium::CFastCard:
            slotString = "CFAST";
            break;
          case CCUPacketTypes::ActiveStorageMedium::SDCard:
            slotString = "SD";
            break;
          case CCUPacketTypes::ActiveStorageMedium::SSDRecorder:
            slotString = "SSD";
            break;
          case CCUPacketTypes::ActiveStorageMedium::USB:
            slotString = "USB";
            break;
        }

        if(!slotString.empty())
          break;
      }
    }

    if(!slotString.empty())
    {
      sprite->fillSmoothRoundRect(20, 120, 100, 40, 3, TFT_DARKGREY);

      sprite->drawCentreString(slotString.c_str(), 70, 130);

      // Show recording error
      if(camera->hasRecordError())
        sprite->drawRoundRect(20, 120, 100, 40, 3, TFT_RED);
    }
    else
    {
      // Show no Media
      sprite->fillSmoothRoundRect(20, 120, 100, 40, 3, TFT_DARKGREY);
      sprite->drawCentreString("NO MEDIA", 70, 135, &AgencyFB_Regular7pt7b);
    }
  }

  // Recording Format - Frame Rate and Resolution
  if(camera->hasRecordingFormat())
  {
    // Frame Rate
    sprite->fillSmoothRoundRect(180, 75, 135, 40, 3, TFT_DARKGREY);

    sprite->drawCentreString(camera->getRecordingFormat().frameRate_string().c_str(), 237, 84);

    sprite->drawCentreString("fps", 285, 89, &AgencyFB_Regular7pt7b);

    // Resolution
    sprite->fillSmoothRoundRect(125, 120, 190, 40, 3, TFT_DARKGREY);

    std::string resolution = camera->getRecordingFormat().frameDimensionsShort_string();
    sprite->drawCentreString(resolution.c_str(), 220, 130);
  }

  // Lens
  if(camera->hasHasLens())
  {
    // Lens
    sprite->fillSmoothRoundRect(20, 165, 295, 40, 3, TFT_DARKGREY);

    if(camera->hasFocalLengthMM() && camera->hasApertureFStopString())
    {
      auto focalLength = camera->getFocalLengthMM();
      std::string focalLengthMM = std::to_string(focalLength);
      std::string combined = focalLengthMM + "mm";

      sprite->drawString(combined.c_str(), 30, 174);
      sprite->drawString(camera->getApertureFStopString().c_str(), 100, 174);
    }
  }

  sprite->pushSprite(0, 0);
}

void Screen_Recording(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Recording;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // If we have a tap, we should determine if it is on anything
  /*
  bool tappedAction = false;
  if(tapped_x != -1 && camera->hasTransportMode())
  {
    if(tapped_x >= 195 && tapped_y <= 128)
    {
      // Record button
      auto transportInfo = camera->getTransportMode();

      if(camera->isRecording)
      {
        DEBUG_VERBOSE("Record Stop");
        transportInfo.mode = CCUPacketTypes::MediaTransportMode::Preview;
      }
      else
      {
        DEBUG_VERBOSE("Record Start");
        transportInfo.mode = CCUPacketTypes::MediaTransportMode::Record;
      }

