marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey-touchdesigner.cpp
      PacketWriter::writeTransportInfo(transportInfo, &cameraConnection);

      tappedAction = true;
    }
  }
  */

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh)
  // if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();

  DEBUG_DEBUG("Screen Recording Refreshed.");

  sprite->fillSprite(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // M5GFX, set font here rather than on each drawString line
  sprite->setFont(&Lato_Regular11pt7b);

  // Record button
  if(camera->isRecording) sprite->fillSmoothCircle(257, 63, 58, TFT_RED); // Recording solid
  sprite->drawCircle(257, 63, 57, (camera->isRecording ? TFT_RED : TFT_LIGHTGREY)); // Outer
  sprite->fillSmoothCircle(257, 63, 38, camera->isRecording ? TFT_RED : TFT_LIGHTGREY); // Inner

  // Timecode
  sprite->setTextColor(camera->isRecording ? TFT_RED : TFT_WHITE);
  sprite->drawString(camera->getTimecodeString().c_str(), 30, 57);

  // Remaining time and any errors
  if(camera->getMediaSlots().size() != 0 && camera->hasActiveMediaSlot())
  {
    sprite->setTextColor(TFT_LIGHTGREY);
    sprite->drawString((camera->getActiveMediaSlot().GetMediumString() + " " + camera->getActiveMediaSlot().remainingRecordTimeString).c_str(), 30, 130);

    sprite->drawString("REMAINING TIME", 30, 153, &Lato_Regular5pt7b);

    // Show any media record errors
    if(camera->hasRecordError())
    {
      sprite->setTextColor(TFT_RED);
      sprite->drawString("RECORD ERROR", 30, 20);
    }
  }

  sprite->pushSprite(0, 0);
}

void Screen_ISO(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::ISO;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // If we have an up/down button press
  bool tappedAction = false;
  std::vector<int> Options_ISO = {200, 400, 640, 800, 1250, 3200, 8000, 12800};
  int Options_ISO_SelectingIndex = -1; // when using up/down buttons keeps track of what option you are navigating to
  if(btnAPressed || btnBPressed)
  {
    if(camera->hasSensorGainISOValue()) // Ensure we have the ISO value before allowing it to be changed
    {
      int currentValue = camera->getSensorGainISOValue();

      bool up = btnBPressed; // up = true, down = false

      // If we don't have a selected value yet, set to the current one
      if(Options_ISO_SelectingIndex == -1)
      {
        auto iter = std::find(Options_ISO.begin(), Options_ISO.end(), currentValue);
        int index = (iter != Options_ISO.end()) ? std::distance(Options_ISO.begin(), iter) : -1;

        if(index != -1)
          Options_ISO_SelectingIndex = index;
      }

      if(Options_ISO_SelectingIndex != -1)
      {
        Options_ISO_SelectingIndex = Options_ISO_SelectingIndex + (up ? 1 : -1); // Move the selected option

        if(Options_ISO_SelectingIndex < 0)
        {
          // Down button on the first option, go to the last option
          Options_ISO_SelectingIndex = Options_ISO.size() -1;
        }
        else if(Options_ISO_SelectingIndex > (Options_ISO.size() - 1))
        {
          // Up button on the last option, go to the first option
          Options_ISO_SelectingIndex = 0;
        }

        // ISO selected, send it to the camera
        PacketWriter::writeISO(Options_ISO[Options_ISO_SelectingIndex], &cameraConnection);

        tappedAction = true;
      }
    }
  }

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();
  
  DEBUG_DEBUG("Screen ISO Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // M5GFX, set font here rather than on each drawString line
  sprite->setFont(&Lato_Regular11pt7b);

  // Get the current ISO value
  int currentISO = 0;
  if(camera->hasSensorGainISOValue())
    currentISO = camera->getSensorGainISOValue();

  // ISO label
  sprite->setTextColor(TFT_WHITE);
  sprite->drawString("ISO", 30, 9, &AgencyFB_Bold9pt7b);

  // sprite->textbgcolor = TFT_DARKGREY;

  // 200
  int labelISO = 200;
  sprite->fillSmoothRoundRect(20, 30, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 0) sprite->drawRoundRect(20, 30, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 65, 41);

  // 400
  labelISO = 400;
  sprite->fillSmoothRoundRect(115, 30, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 1) sprite->drawRoundRect(115, 30, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 160, 36);
  sprite->drawCentreString("NATIVE", 160, 59, &Lato_Regular5pt7b);

  // 8000
  labelISO = 8000;
  sprite->fillSmoothRoundRect(210, 30, 100, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 6) sprite->drawRoundRect(210, 30, 100, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 260, 41);

  // 640
  labelISO = 640;
  sprite->fillSmoothRoundRect(20, 75, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 2) sprite->drawRoundRect(20, 75, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 65, 87);

  // 800
  labelISO = 800;
  sprite->fillSmoothRoundRect(115, 75, 90, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 3) sprite->drawRoundRect(115, 75, 90, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 160, 87);

  // 12800
  labelISO = 12800;
  sprite->fillSmoothRoundRect(210, 75, 100, 40, 3, (currentISO == labelISO ? TFT_DARKGREEN : TFT_DARKGREY));
  if(Options_ISO_SelectingIndex == 7) sprite->drawRoundRect(210, 75, 100, 40, 1, TFT_WHITE);
  sprite->drawCentreString(String(labelISO).c_str(), 260, 87);

