marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey-touchdesigner.cpp
}

void Screen_Lens(bool forceRefresh = false)
{
  if(!BMDControlSystem::getInstance()->hasCamera())
    return;

  connectedScreenIndex = Screens::Lens;

  auto camera = BMDControlSystem::getInstance()->getCamera();

  // If we have a tap, we should determine if it is on anything
  /*
  bool tappedAction = false;
  if(tapped_x != -1 && camera->hasTransportMode())
  {
    if(tapped_x >= 200 && tapped_y <= 120)
    {
      // Focus button
      PacketWriter::writeAutoFocus(&cameraConnection);

      DEBUG_DEBUG("Instantaneous Autofocus");
      
      tappedAction = true;
    }
  }
  */

  // If the screen hasn't changed, there were no touch events and we don't have to refresh, return.
  if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh)
  // if(lastRefreshedScreen == camera->getLastModified() && !forceRefresh && !tappedAction)
    return;
  else
    lastRefreshedScreen = camera->getLastModified();

  DEBUG_DEBUG("Screen Lens Refreshed.");

  sprite->fillScreen(TFT_BLACK);

  Screen_Common_Connected(); // Common elements

  // M5GFX, set font here rather than on each drawString line
  sprite->setFont(&Lato_Regular11pt7b);

  // Focus button
  sprite->drawCircle(257, 63, 57, TFT_BLUE); // Outer
  sprite->fillSmoothCircle(257, 63, 54, TFT_SKYBLUE); // Inner
  sprite->setTextColor(TFT_WHITE);
  sprite->drawCentreString("FOCUS", 257, 50);

  if(camera->hasFocalLengthMM())
  {
    auto focalLength = camera->getFocalLengthMM();
    std::string focalLengthMM = std::to_string(focalLength);
    std::string combined = focalLengthMM + "mm";

    sprite->drawString(combined.c_str(), 30, 25, &Lato_Regular12pt7b);
  }

  if(camera->hasApertureFStopString())
  {
      sprite->drawString(camera->getApertureFStopString().c_str(), 30, 50, &Lato_Regular12pt7b);
  }

  sprite->pushSprite(0, 0);
}

// Splits the TouchDesigner string into the command and the value parts
std::vector<std::string> splitTDCommand(const std::string& command) {
  std::vector<std::string> parts;

  // Find the index of the colon character
  size_t colonIndex = command.find(':');

  if (colonIndex != std::string::npos) {
    // Split the command into two parts
    std::string commandPart = command.substr(0, colonIndex);
    std::string valuePart = command.substr(colonIndex + 1);

    // Add the parts to the vector
    parts.push_back(commandPart);
    parts.push_back(valuePart);
  }

  return parts;
}

// Upper case a string
std::string capitaliseString(const std::string& str) {
  std::string result = str;

  for (char& c : result) {
    c = std::toupper(c);
  }

  return result;
}

// Removes Null characters from the TouchDesigner strings (as it can send them through)
std::string removeNullCharacter(const std::string& str) {
    std::string result;
    
    for (char c : str) {
        if (c != '\0') {
            result += c;
        }
    }

    return result;
}

// Check if a string is an integer (whole number)
bool isInteger(const std::string& str) {
  if (str.empty()) {
    return false;
  }

  for (char c : str) {

    if (!std::isdigit(c)) {
      
      // Convert the character to its integer value (character code)
      int charCode = static_cast<int>(c);

      // Print the non-digit character and its character code
      Serial.print("[IsInteger NOT A DIGIT] character: ");
      Serial.print(c);
      Serial.print(" (Character code: ");
      Serial.print(charCode);
      Serial.println(")");

      return false;
    }
  }

  return true;
}


// Convert a string to an integer
int convertToInt(const std::string& str) {
  try {
    return std::stoi(str);
  } catch (const std::exception& e) {
    return -1; // Default value
  }
}

// Processes and runs TouchDesigner commands sent over Serial
void RunTouchDesignerCommand(std::string commandPart, std::string valuePart)
{
  commandPart = capitaliseString(commandPart);
  bool haveCamera = BMDControlSystem::getInstance()->hasCamera();

  Serial.println(String("TouchDesigner Command Received: ") + commandPart.c_str() + ":" + valuePart.c_str());

  if(commandPart == "RECORD" && haveCamera)
  {
    Serial.println("[Command RECORD]: Processing RECORD");

    auto camera = BMDControlSystem::getInstance()->getCamera();

    if(camera->hasTransportMode())
    {
      Serial.println("[Command RECORD]: Getting Transport Mode");

      auto transportInfo = camera->getTransportMode();

      Serial.println("[Command RECORD]: Have Transport Mode");

      valuePart = capitaliseString(valuePart);

      Serial.println("[Command RECORD]: Value capitalised:");
      Serial.println(valuePart.c_str());

      if(valuePart == "START")
      {
        Serial.println("[Command RECORD]: Value part is START.");

        if(!camera->isRecording)
        {
          transportInfo.mode = CCUPacketTypes::MediaTransportMode::Record;
          PacketWriter::writeTransportInfo(transportInfo, &cameraConnection);
          Serial.println("[Command RECORD]: Start Recording sent to camera");
        }
        else
          Serial.println("[Command RECORD]: Camera already recording, can't send.");
      }
      else if(valuePart == "STOP")
      {
        Serial.println("[Command RECORD]: Value part is STOP.");

        if(camera->isRecording)
        {
          transportInfo.mode = CCUPacketTypes::MediaTransportMode::Preview;
          PacketWriter::writeTransportInfo(transportInfo, &cameraConnection);
          Serial.println("[Command RECORD]: Stop Recording sent to camera");
        }
        else
          Serial.println("[Command RECORD]: Camera was not recording, can't stop.");
      }
      else
        Serial.println("[Command RECORD]: Transport Mode has not been received, can't send.");
    }
    else
      Serial.println("[Command RECORD]: Transport Mode has not been received, can't send.");
  }
  else if(commandPart == "SHUTTERANGLE" && haveCamera)
  {
    int value = std::stoi(valuePart);

    if(value >= 1 and value <= 360)
    {
      PacketWriter::writeShutterAngle(value * 100, &cameraConnection); // Shutter angle is times 100
      Serial.println("Shutter Angle sent to camera");
    }
  }
  else if(commandPart == "SHUTTERSPEED" && haveCamera)
  {
    int value = std::stoi(valuePart);

    if(value >= 24 and value <= 2000)
    {
      PacketWriter::writeShutterSpeed(value, &cameraConnection); // Shutter speed command
      Serial.println("Shutter Speed sent to camera");
    }
  }
  else if(commandPart == "ISO" && haveCamera)
  {
    Serial.println("[Command ISO]: Processing ISO");

    if(isInteger(valuePart)) // Ensure we have a whole number
    {
      int value = std::stoi(valuePart);

      // Accepting values between 
      if(value >= 100 and value <= 25600)
      {
        PacketWriter::writeISO(value, &cameraConnection); // ISO command
        Serial.println("[Command ISO]: ISO sent to camera");
      }
      else
        Serial.println("[Command ISO]: Value was not between 100 and 25600, can't send.");
    }
    else
      Serial.println("[Command ISO]: Value was not an integer number.");
  }
  else if((commandPart == "TINT" || commandPart == "WHITEBALANCE") && haveCamera)
  {
    auto camera = BMDControlSystem::getInstance()->getCamera();

