marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey-touchdesigner.cpp
    // Get the current White Balance value
    int currentWB = 0;
    if(camera->hasWhiteBalance())
      currentWB = camera->getWhiteBalance();

    // Get the current Tint value
    int currentTint = 0;
    if(camera->hasTint())
      currentTint = camera->getTint();

    if(commandPart == "WHITEBALANCE" && haveCamera)
    {
      int value = std::stoi(valuePart);

      if(value >= 2500 and value <= 10000)
      {
        PacketWriter::writeWhiteBalance(value, currentTint, &cameraConnection); // White Balance command
        Serial.println("White Balance sent to camera");
      }
    }
    else if(commandPart == "TINT" && haveCamera)
    {
      int value = std::stoi(valuePart);

      if(value >= -50 and value <= 50)
      {
        PacketWriter::writeWhiteBalance(currentWB, value, &cameraConnection); // Tint command
        Serial.println("Tint sent to camera");
      }
    }
  }
  else if(commandPart == "BRAWQ" && haveCamera)
  {
    auto camera = BMDControlSystem::getInstance()->getCamera();
    CodecInfo currentCodec = camera->getCodec();

    if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
    {
      int value = std::stoi(valuePart);

      switch(value)
      {
        case 0: // Q0
          PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAWQ0), &cameraConnection);
          Serial.println("BRAW Q0 sent to camera");
          break;
        case 1: // Q1
          PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAWQ1), &cameraConnection);
          Serial.println("BRAW Q1 sent to camera");
          break;
        case 3: // Q3
          PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAWQ3), &cameraConnection);
          Serial.println("BRAW Q3 sent to camera");
          break;
        case 5: // Q5
          PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAWQ5), &cameraConnection);
          Serial.println("BRAW Q5 sent to camera");
          break;
        default:
          Serial.println("Unknown value for BRAW Quality");
      }
    }
    else
    Serial.println("Camera must be set to BRAW to change BRAW Quality setting");
  }
  else if(commandPart == "BRAWB" && haveCamera)
  {
    auto camera = BMDControlSystem::getInstance()->getCamera();
    CodecInfo currentCodec = camera->getCodec();

    if(currentCodec.basicCodec == CCUPacketTypes::BasicCodec::BRAW)
    {
      int value = std::stoi(valuePart);

      switch(value)
      {
        case 3: // 3:1
          PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAW3_1), &cameraConnection);
          Serial.println("BRAW 3:1 sent to camera");
          break;
        case 5: // 5:1
          PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAW5_1), &cameraConnection);
          Serial.println("BRAW 5:1 sent to camera");
          break;
        case 8: // 8:1
          PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAW8_1), &cameraConnection);
          Serial.println("BRAW 8:1 sent to camera");
          break;
        case 12: // 12:1
          PacketWriter::writeCodec(CodecInfo(CCUPacketTypes::BasicCodec::BRAW, CCUPacketTypes::CodecVariants::kBRAW12_1), &cameraConnection);
          Serial.println("BRAW 12:1 sent to camera");
          break;
        default:
          Serial.println("Unknown value for BRAW Bitrate");
      }
    }
    else
      Serial.println("Camera must be set to BRAW to change BRAW Quality setting");
  }
  else
    Serial.println("[UNKNOWN TOUCHDESIGNER COMMAND");
}

void setup() {

  M5.begin(); //true, false, true, false, false);

  tft.setColorDepth(16);
  tft.setSwapBytes(true);

  tft.setTextDatum(TL_DATUM);
  tft.setTextPadding(tft.width());
  tft.setTextColor( TFT_WHITE);
  tft.setTextSize(1);
  tft.setFont(&Lato_Regular11pt7b);

  sprite = new LGFX_Sprite(&tft);
  sprite->setPsram(false);
  sprite->setColorDepth(BPP_SPRITE);
  sprite->setSwapBytes(true);
  sprite->setTextSize(1);
  sprite->setFont(&Lato_Regular11pt7b);


  /* To use Deep Sleep and use button B to wake up, the following code can be used.
      However, as the device won't maintain a connection while asleep, there isn't much point. Power button on the side can be used to shutdown.
      Power off: Quickly double-click the red power button on the left
      If you do want to go to deep sleep in your code, you can run the following code: esp_deep_sleep_start();

  pinMode(GPIO_NUM_38, INPUT_PULLUP); // Button B on M5Stack is GPIO 38, that's the one to wake up from sleep

  // Check if the ESP32 woke up from a deep sleep
  if (esp_sleep_get_wakeup_cause() == ESP_SLEEP_WAKEUP_EXT0) {
    Serial.begin(115200);
    Serial.println("Woke up from sleep!");
    // Additional actions can be performed here after waking up
  } else {
    Serial.begin(115200);
    Serial.println("First boot!");
    // Additional setup can be performed here on the first boot
  }
  // Configure wake-up source
  esp_sleep_enable_ext0_wakeup(GPIO_NUM_38, LOW);
  */

  // SET DEBUG LEVEL
  Debug.setDebugLevel(DBG_VERBOSE);
  Debug.timestampOn();

  // Allow a timeout of 30 seconds for time for the pass key entry. It's slower with buttons
  esp_task_wdt_init(35, true);

  // Splash screen
  tft.pushImage(0, 0, IWIDTH, IHEIGHT, MPCSplash_M5Stack_CoreS3);

  // Prepare for Bluetooth connections and start scanning for cameras
  cameraConnection.initialise(&tft, IWIDTH, IHEIGHT); // Screen Pass Key entry
}

int memoryLoopCounter;
bool hitRecord = false; // Let's just hit record once.

void loop() {

  static unsigned long lastConnectedTime = 0;
  const unsigned long reconnectInterval = 5000;  // 5 seconds (milliseconds)

  unsigned long currentTime = millis();

  if ((cameraConnection.status == BMDCameraConnection::ConnectionStatus::Disconnected || cameraConnection.status == BMDCameraConnection::ConnectionStatus::FailedPassKey) && currentTime - lastConnectedTime >= reconnectInterval) {
    
