marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey-touchdesigner.cpp
    if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::Disconnected)
      DEBUG_VERBOSE("Disconnected for too long, trying to reconnect");
    else
      DEBUG_VERBOSE("Failed Pass Key, trying to reconnect");

    // Set the status to Scanning and then show the NoConnection screen to render the Scanning page before starting the scan (which blocks so it can't render the Scanning page before it finishes)
    cameraConnection.status = BMDCameraConnection::ConnectionStatus::Scanning;
    Screen_NoConnection();

    cameraConnection.scan();

    if(connectedScreenIndex != Screens::NoConnection) // Move to the No Connection screen if we're not on it
      Screen_NoConnection();
  }
  else if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::Connected)
  {
    auto camera = BMDControlSystem::getInstance()->getCamera();

    if(static_cast<byte>(connectedScreenIndex) >= 100)
    {
      // Check if the initial payload has been fully received and if it was after the camera's last modified time, update the camera's modified time
      if(cameraConnection.getInitialPayloadTime() != ULONG_MAX && cameraConnection.getInitialPayloadTime() > camera->getLastModified())
        camera->setLastModified();

      switch(connectedScreenIndex)
      {
        case Screens::Dashboard:
          Screen_Dashboard();
          break;
        case Screens::Recording:
          Screen_Recording();
          break;
        case Screens::ISO:
          Screen_ISO();
          break;
        case Screens::ShutterAngleSpeed:
          if(camera->shutterValueIsAngle)
            Screen_ShutterAngle();
          else
            Screen_ShutterSpeed();
          break;
        case Screens::WhiteBalanceTintWB:
        case Screens::WhiteBalanceTintT:
          Screen_WBTint(connectedScreenIndex == Screens::WhiteBalanceTintWB);
          break;
        case Screens::Codec:
          Screen_Codec();
          break;
        case Screens::Resolution:
          Screen_Resolution();
          break;
        case Screens::Media:
          Screen_Media();
          break;
        case Screens::Lens:
          Screen_Lens();
          break;
      }
    }
    else
      Screen_Dashboard(true); // Was on disconnected screen, now we're connected go to the dashboard

    lastConnectedTime = currentTime;
  }
  else if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::ScanningFound)
  {
    DEBUG_DEBUG("Cameras found!");

    cameraConnection.connect(cameraConnection.cameraAddresses[0]);

    if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::FailedPassKey)
      DEBUG_DEBUG("Loop - Failed Pass Key");

    // Clear the screen so we can show the dashboard cleanly
    tft.fillScreen(TFT_BLACK);

    lastConnectedTime = currentTime;
  }
  else if(cameraConnection.status == BMDCameraConnection::ConnectionStatus::ScanningNoneFound)
  {
    DEBUG_VERBOSE("Status Scanning NONE Found. Marking as Disconnected.");
    cameraConnection.status = BMDCameraConnection::Disconnected;
    lastConnectedTime = currentTime;

    Screen_NoConnection();
  }

  // Buttons
  btnAPressed = false;
  btnBPressed = false;
  M5.update();

  // Check Serial for TouchDesigner input
  // 'A' = Button A press, 'B' = Button B press, 'C' = Button C press
  char TouchDesignerPress = ' ';

  if(tdCommandComplete)
  {
    std::vector<std::string> commandParts = splitTDCommand(tdCommand);

    std::string commandPart = commandParts[0];
    std::string valuePart = commandParts[1];

    // Process button presses
    if(commandPart == "BUTTON")
    {
      if(valuePart == "A")
        TouchDesignerPress = 'A';
      else if(valuePart == "B")
        TouchDesignerPress = 'B';
      else if(valuePart == "C")
        TouchDesignerPress = 'C';
    }
    else
    {
      // It's not a Button command, so let's process it in a separate function
      RunTouchDesignerCommand(commandPart, removeNullCharacter(valuePart));
    }

    // Reset ready for the next command
    tdCommandComplete = false;
  }

  /*
  if (Serial.available()) {
      int ch = Serial.read();

      switch(ch)
      {
        case 65:
          TouchDesignerPress = 'A';
          break;
        case 66:
          TouchDesignerPress = 'B';
          break;
        case 67:
          TouchDesignerPress = 'C';
          break;
        case 77: // M
        if(BMDControlSystem::getInstance()->hasCamera())
            PacketWriter::writeISO(400, &cameraConnection);
          break;
        case 78: // N
        if(BMDControlSystem::getInstance()->hasCamera())
            PacketWriter::writeISO(800, &cameraConnection);
          break;
        case 79: // O
        if(BMDControlSystem::getInstance()->hasCamera())
            PacketWriter::writeISO(1600, &cameraConnection);
          break;
        case 80: // P
        if(BMDControlSystem::getInstance()->hasCamera())
            PacketWriter::writeISO(3200, &cameraConnection);
          break;
      }
  }
  */

  if(M5.BtnA.wasPressed() || M5.BtnB.wasPressed() || M5.BtnC.wasPressed() || TouchDesignerPress != ' ')
  {
    // Left button function changes on context
    // Only handle dashboard here
    if(M5.BtnA.wasPressed() || TouchDesignerPress == 'A')
    {
      DEBUG_DEBUG("Button A");

      switch(connectedScreenIndex)
      {
        case Screens::Dashboard:
        case Screens::Recording:
        case Screens::ISO:
        case Screens::ShutterAngleSpeed:
        case Screens::WhiteBalanceTintWB:
        case Screens::WhiteBalanceTintT:
        case Screens::Codec:
        case Screens::Resolution:
        case Screens::Media:
        case Screens::Lens:
          // Indicate to the other screens the first button has been pressed
          btnAPressed = true;
          break;
      }
    }
    else if(M5.BtnB.wasPressed() || TouchDesignerPress == 'B')
    {
      DEBUG_DEBUG("Button B");

      switch(connectedScreenIndex)
      {
        case Screens::Dashboard:
        case Screens::Recording:

          // RECORD START/STOP FOR DASHBOARD AND RECORDING SCREEN
          if(connectedScreenIndex == Screens::Dashboard || connectedScreenIndex == Screens::Recording)
          {
            // Do we have a camera instance created (happens when connected)
            if(BMDControlSystem::getInstance()->hasCamera())
            {
                // Get the camera instance so we can check the state of it
                auto camera = BMDControlSystem::getInstance()->getCamera();

                // Only hit record if we have the Transport Mode info (knowing if it's recording) and we're not already recording.
                if(camera->hasTransportMode())
                {
                    // Record button
                    DEBUG_VERBOSE("Record Start/Stop");

