marklysze/Magic-Pocket-Control-ESP32/src/main/main-m5stack-grey-touchdesigner.cpp
                    auto transportInfo = camera->getTransportMode();

                    if(!camera->isRecording)
                      transportInfo.mode = CCUPacketTypes::MediaTransportMode::Record;
                    else
                      transportInfo.mode = CCUPacketTypes::MediaTransportMode::Preview;

                    // Send the packet to the camera to start recording
                    PacketWriter::writeTransportInfo(transportInfo, &cameraConnection);
                }
            }
          }
          break;
        case Screens::ISO:
        case Screens::ShutterAngleSpeed:
        case Screens::WhiteBalanceTintWB:
        case Screens::WhiteBalanceTintT:
        case Screens::Codec:
        case Screens::Resolution:
        case Screens::Media:
        case Screens::Lens:
          // Indicate to the other screens the second button has been pressed
          btnBPressed = true;
          break;
      }
    }
    else if(M5.BtnC.wasPressed() || TouchDesignerPress == 'C')
    {
      DEBUG_DEBUG("Button C > NEXT SCREEN");

      switch(connectedScreenIndex)
      {
        case Screens::Dashboard:
          connectedScreenIndex = Screens::Recording;
          break;
        case Screens::Recording:
          connectedScreenIndex = Screens::ISO;
          break;
        case Screens::ISO:
          connectedScreenIndex = Screens::ShutterAngleSpeed;
          break;
        case Screens::ShutterAngleSpeed:
          connectedScreenIndex = Screens::WhiteBalanceTintWB;
          break;
        case Screens::WhiteBalanceTintWB:
          connectedScreenIndex = Screens::WhiteBalanceTintT;
          break;
        case Screens::WhiteBalanceTintT:
          connectedScreenIndex = Screens::Codec;
          break;
        case Screens::Codec:
          connectedScreenIndex = Screens::Resolution;
          break;
        case Screens::Resolution:
          connectedScreenIndex = Screens::Media;
          break;
        case Screens::Media:
          connectedScreenIndex = Screens::Lens;
          break;
        case Screens::Lens:
          connectedScreenIndex = Screens::Dashboard;
          break;
      }

      lastRefreshedScreen = 0; // Forces a refresh
    }
  }

  delay(5);
}

void serialEvent()
{
  while (Serial.available()) {
    char incomingChar = (char)Serial.read();

    // Check if the incoming character is the start of the string
    if (incomingChar == '(') {
      tdCommand = ""; // Clear the previous string
    }
    // Check if the incoming character is the end of the string
    else if (incomingChar == ')') {

      // Ensure that we have a colon in the string
      if(tdCommand.find(':') != std::string::npos)
      {
        tdCommandComplete = true; // We're good to go to process this command
      }
      else
      {
        // No colon, so we'll clear the command and try and start again
        tdCommand == "";
        tdCommandComplete = false;
      }
    }
    // Append the character to the input string
    else {
      if (tdCommand.length() < tdMaxLength) {
        tdCommand += incomingChar;
      }
    }
  }
}